taylortrimble/pic18usb/lab1.c
void ProcessSetupToken(void) {
    unsigned char n;

    for (n = 0; n<8; n++) {
        gBufferData[n] = gCurrentBufferDescriptor.address[n];
    }
    _USBBD0O.count = MAX_PACKET_SIZE;   // reset the EP0 OUT byte count
    _USBBD0I.status = 0x08;         // return the EP0 IN buffer to us (dequeue any pending requests)
    _USBBD0O.status = (!(gBufferData[bmRequestType_OFFSET]&0x80) && (gBufferData[wLengthL_OFFSET] || gBufferData[wLengthH_OFFSET])) ? 0xC8:0x88;   // set EP0 OUT UOWN back to USB and DATA0/DATA1 packet according to the request type
    UCONbits.PKTDIS = 0;            // assuming there is nothing to dequeue, clear the packet disable bit
    _USBEngineStatus = USBEngineStatusReset;       // clear the device request in process
    switch (gBufferData[bmRequestType_OFFSET]&0x60) {  // extract request type bits
        case STANDARD:
            StandardRequests();
            break;
        case CLASS:
            ClassRequests();
            break;
        case VENDOR:
            VendorRequests();
            break;
        default:
            HandleError();    // set Request Error Flag
    }
}

void StandardRequests(void) {
    unsigned char *UEP;
    unsigned char n;
    USBBufferDescriptor *currentBufferDescriptor;

    // Some of my framework's variables for processing requests
    unsigned char bRequest;
    unsigned char bmRequestType;
    unsigned wValue;
    unsigned wIndex;
    unsigned wLength;

    // Initialized in the existing framework style
    bRequest = gBufferData[bRequest_OFFSET];
    bmRequestType = gBufferData[bmRequestType_OFFSET];
    wValue = gBufferData[wValueL_OFFSET] + (gBufferData[wValueH_OFFSET])*0x100;
    wIndex = gBufferData[wIndexL_OFFSET] + (gBufferData[wIndexH_OFFSET])*0x100;
    wLength = gBufferData[wLengthL_OFFSET] + (gBufferData[wLengthH_OFFSET])*0x100;

    switch (bRequest) {
        case GET_STATUS:
            switch (bmRequestType & 0x1F) {  // extract request recipient bits
                case RECIPIENT_DEVICE:
                    _USBBD0I.address[0] = gUSBDeviceStatus;
                    _USBBD0I.address[1] = 0x00;
                    _USBBD0I.count = 0x02;
                    _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    break;
                case RECIPIENT_INTERFACE:
                    switch (_USBDeviceState) {
                        case USBDeviceStateAddressed:
                            HandleError();    // set Request Error Flag
                            break;
                        case USBDeviceStateConfigured:
                            if ((wIndex & 0x00FF)<NUM_INTERFACES) {
#warning need to check here and elsewhere that word values wValue, wIndex, wLength are accessing just high or low byte fOR a rEASON!!
                                _USBBD0I.address[0] = 0x00;
                                _USBBD0I.address[1] = 0x00;
                                _USBBD0I.count = 0x02;
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                HandleError();    // set Request Error Flag
                            }
                    }
                    break;
                case RECIPIENT_ENDPOINT:
                    switch (_USBDeviceState) {
                        case USBDeviceStateAddressed:
                            if (!(wIndex&0x0F)) {  // get EP, strip off direction bit and see if it is EP0
                                _USBBD0I.address[0] = ((((wIndex&0x00FF)&0x80) ? _USBBD0I.status:_USBBD0O.status)&0x04)>>2; // return the BSTALL bit of EP0 IN or OUT, whichever was requested
                                _USBBD0I.address[1] = 0x00;
                                _USBBD0I.count = 0x02;
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                HandleError();    // set Request Error Flag
                            }
                            break;
                        case USBDeviceStateConfigured:
                            UEP = (unsigned char *)&UEP0;
                            n = wIndex & 0x0F;   // get EP and strip off direction bit for offset from UEP0
                            currentBufferDescriptor = &_USBBD0O+((n<<1)|(((wIndex&0x00FF)&0x80) ? 0x01:0x00)); // compute pointer to the buffer descriptor for the specified EP
                            if (UEP[n]&(((wIndex&0x00FF)&0x80) ? 0x02:0x04)) { // if the specified EP is enabled for transfers in the specified direction...
                                _USBBD0I.address[0] = ((currentBufferDescriptor->status)&0x04)>>2; // ...return the BSTALL bit of the specified EP
                                _USBBD0I.address[1] = 0x00;
                                _USBBD0I.count = 0x02;
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                HandleError();    // set Request Error Flag
                            }
                            break;
                        default:
                            HandleError();    // set Request Error Flag
                    }
                    break;
                default:
                    HandleError();    // set Request Error Flag
            }
            break;
        case CLEAR_FEATURE:
        case SET_FEATURE:
            switch (bmRequestType&0x1F) {  // extract request recipient bits
                case RECIPIENT_DEVICE:
                    switch (wValue & 0x00FF) {
                        case DEVICE_REMOTE_WAKEUP:
                            if (bRequest == CLEAR_FEATURE)
                                gUSBDeviceStatus &= 0xFE;
                            else
                                gUSBDeviceStatus |= 0x01;
                            _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                            _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            break;
                        default:
                            HandleError();    // set Request Error Flag
                    }
                    break;
                case RECIPIENT_ENDPOINT:
                    switch (_USBDeviceState) {
                        case USBDeviceStateAddressed:
                            if (!(wIndex & 0x0F)) {  // get EP, strip off direction bit, and see if its EP0
                                _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                            } else {
                                HandleError();    // set Request Error Flag
                            }
                            break;
                        case USBDeviceStateConfigured:
                            UEP = (unsigned char *)&UEP0;
                            if (n = wIndex & 0x0F) { // get EP and strip off direction bit for offset from UEP0, if not EP0...
                                currentBufferDescriptor = &_USBBD0O+((n<<1)|((gBufferData[wIndex]&0x80) ? 0x01:0x00)); // compute pointer to the buffer descriptor for the specified EP
                                if ((wIndex&0x00FF)&0x80) { // if the specified EP direction is IN...
                                    if (UEP[n]&0x02) {  // if EPn is enabled for IN transfers...
                                        currentBufferDescriptor->status = (bRequest==CLEAR_FEATURE) ? 0x00:0x84;
                                    } else {
                                        HandleError();    // set Request Error Flag
                                    }
                                } else {    // ...otherwise the specified EP direction is OUT, so...
                                    if (UEP[n]&0x04) {  // if EPn is enabled for OUT transfers...
                                        currentBufferDescriptor->status = (bRequest == CLEAR_FEATURE) ? 0x88:0x84;
                                    } else {
                                        HandleError();    // set Request Error Flag
                                    }
                                }
                            }
                            if (!(gErrorCondition)) {  // if there was no Request Error...
                                _USBBD0I.count = 0x00;
                                _USBBD0I.status = 0xC8;     // ...send packet as DATA1, set UOWN bit
                            }
                            break;
                        default:
                            HandleError();    // set Request Error Flag
                    }
                    break;
                default:
                    HandleError();    // set Request Error Flag
            }
            break;
        case SET_ADDRESS:
            if ((wValue&0x00FF)>0x7F) { // if new device address is illegal, send Request Error
                HandleError();    // set Request Error Flag
            } else {
                _USBEngineStatus |= USBEngineStatusAddressing;  // processing a SET_ADDRESS request
                gUSBPendingAddress = (wValue&0x00FF);  // save new address
                _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            }
            break;
        case GET_DESCRIPTOR:
            _USBEngineStatus |= USBEngineStatusSendingDescriptor;   // readying a GET_DESCRIPTOR request
            switch ((wValue>>8)&0x00FF) {       // High byte indicates which type of descriptor to return
                case DEVICE:
                    gDescriptorToSend = gkDevice;
                    gUSBBytesLeft = gDescriptorToSend[0];
                    if ((wLength<gUSBBytesLeft)) {
                        gUSBBytesLeft = wLength;
                    }
                    SendDescriptorPacket();
                    break;
                case CONFIGURATION:
                    switch (wValue & 0x00FF) {
                        case 0:
                            gDescriptorToSend = gkConfiguration1;
                            break;
                        default:
                            HandleError();    // set Request Error Flag
                    }
                    if (!(gErrorCondition)) {
                        gUSBBytesLeft = gDescriptorToSend[2];   // wTotalLength at an offset of 2
                        if (wLength<gUSBBytesLeft) {
                            gUSBBytesLeft = wLength;
                        }
                        SendDescriptorPacket();
                    }
                    break;
                case STRING:
                    switch (wValue & 0x00FF) {
                        case 0:
                            gDescriptorToSend = gkString0;
                            break;
                        case 1:
                            gDescriptorToSend = gkString1;
                            break;
                        case 2:
                            gDescriptorToSend = gkString2;
                            break;
                        default:
                            HandleError();    // set Request Error Flag
                    }
                    if (!(gErrorCondition)) {
                        gUSBBytesLeft = gDescriptorToSend[0];
                        if (wLength<gUSBBytesLeft) {
                            gUSBBytesLeft = wLength;
                        }
                        SendDescriptorPacket();
                    }
                    break;
                default:
                    HandleError();    // set Request Error Flag
            }
            break;
        case GET_CONFIGURATION:
            _USBBD0I.address[0] = gCurrentConfiguration;  // copy current device configuration to EP0 IN buffer
            _USBBD0I.count = 0x01;
            _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            break;
        case SET_CONFIGURATION:
            if ((wValue&0x00FF)<=NUM_CONFIGURATIONS) {
                UEP1 = 0x00;    // clear all EP control registers except for EP0 to disable EP1-EP15 prior to setting configuration
                UEP2 = 0x00;
                UEP3 = 0x00;
                UEP4 = 0x00;
                UEP5 = 0x00;
                UEP6 = 0x00;
                UEP7 = 0x00;
                switch (gCurrentConfiguration = (wValue&0x00FF)) {
                    case 0:
                        _USBDeviceState = USBDeviceStateAddressed;
#ifdef SHOW_ENUM_STATUS
                        LATC &= 0xE0;
                        LATCbits.LATC2 = 1;
#endif
                        break;
                    default:
                        _USBDeviceState = USBDeviceStateConfigured;
#ifdef SHOW_ENUM_STATUS
                        LATC &= 0xE0;
                        LATCbits.LATC3 = 1;
#endif
                }
                _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            } else {
                HandleError();    // set Request Error Flag
            }
            break;
        case GET_INTERFACE:
            switch (_USBDeviceState) {
                case USBDeviceStateConfigured:
                    if ((wIndex&0x00FF)<NUM_INTERFACES) {
                        _USBBD0I.address[0] = 0x00; // always send back 0 for bAlternateSetting
                        _USBBD0I.count = 0x01;
                        _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                    } else {
                        HandleError();    // set Request Error Flag
                    }
                    break;
                default:
                    HandleError();    // set Request Error Flag
            }
            break;
        case SET_INTERFACE:
            switch (_USBDeviceState) {
                case USBDeviceStateConfigured:
                    if ((wIndex&0x00FF)<NUM_INTERFACES) {
                        switch ((wValue&0x00FF)) {
                            case 0:     // currently support only bAlternateSetting of 0
                                _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
                                _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
                                break;
                            default:
                                HandleError();    // set Request Error Flag
                        }
                    } else {
                        HandleError();    // set Request Error Flag
                    }
                    break;
                default:
                    HandleError();    // set Request Error Flag
            }
            break;
        case SET_DESCRIPTOR:
        case SYNCH_FRAME:
        default:
            HandleError();    // set Request Error Flag
    }
}

void ClassRequests(void) {
    switch (gBufferData[bRequest_OFFSET]) {
        default:
            HandleError();    // set Request Error Flag
    }
}

void VendorRequests(void) {
    switch (gBufferData[bRequest_OFFSET]) {
        case SET_RA0:
            PORTAbits.RA0 = 1;      // set RA0 high
            _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
            _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            break;
        case CLR_RA0:
            PORTAbits.RA0 = 0;      // set RA0 low
            _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
            _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            break;
        default:
            HandleError();    // set Request Error Flag
    }
}

void ProcessInToken(void) {
    switch (gCachedUSTAT&0x18) {   // extract the EP bits
        case EP0:
            if (_USBEngineStatus & USBEngineStatusAddressing) {
                switch (UADDR = gUSBPendingAddress) {
                    case 0:
                        _USBDeviceState = USBDeviceStateInitialized;
#ifdef SHOW_ENUM_STATUS
                        LATC &= 0xE0;
                        LATCbits.LATC1 = 1;
#endif
                        break;
                    default:
                        _USBDeviceState = USBDeviceStateAddressed;
#ifdef SHOW_ENUM_STATUS
                        LATC &= 0xE0;
                        LATCbits.LATC2 = 1;
#endif
                }
                _USBEngineStatus &= ~USBEngineStatusAddressing;
            } else if (_USBEngineStatus & USBEngineStatusSendingDescriptor) {
                SendDescriptorPacket();
            }
            break;
        case EP1:
            break;
        case EP2:
            break;
    }
}

void ProcessOutToken(void) {
    switch (gCachedUSTAT&0x18) {   // extract the EP bits
        case EP0:
            _USBBD0O.count = MAX_PACKET_SIZE;
            _USBBD0O.status = 0x88;
            _USBBD0I.count = 0x00;      // set EP0 IN byte count to 0
            _USBBD0I.status = 0xC8;     // send packet as DATA1, set UOWN bit
            break;
        case EP1:
            break;
        case EP2:
            break;
    }
}

void SendDescriptorPacket(void) {
    unsigned char n;

    if (gUSBBytesLeft<MAX_PACKET_SIZE) {
        _USBEngineStatus &= ~USBEngineStatusSendingDescriptor;   // sending a short packet, no longer sending after this
        gUSBPacketLength = gUSBBytesLeft;
        gUSBBytesLeft = 0x00;
    } else {
        gUSBPacketLength = MAX_PACKET_SIZE;
        gUSBBytesLeft -= MAX_PACKET_SIZE;
    }
    for (n = 0; n<gUSBPacketLength; n++) {
        _USBBD0I.address[n] = *gDescriptorToSend++;
    }
    _USBBD0I.count = gUSBPacketLength;
    _USBBD0I.status = ((_USBBD0I.status^0x40)&0x40)|0x88; // toggle the DATA01 bit, clear the PIDs bits, and set the UOWN and DTS bits
}

void main(void) {
    InitUSB();          // initialize the USB registers and serial interface engine
    while (1) {
        ServiceUSB();
    }
}
